# <center> Foundation of Computer Science </center>

# <center> Comandi base Python </center>

## Liste
Assegnamento

In [1]:
lis = [2, 4, 9.7, 'elemento', 11, 45];lis
type(lis)

list

Accedere ad un singolo elemento della lista:

In [2]:
lis[3]
lis[3:5]

['elemento', 11]

Modificare in una posizione specifica l'elemento di una lista:

In [3]:
lis[3]=99
lis

[2, 4, 9.7, 99, 11, 45]

Stampare il penultimo elemento della lista:

In [4]:
lis[-2]

11

Aggiungere alla fine della lista un elemento:

In [5]:
lis.append(36)
lis

[2, 4, 9.7, 99, 11, 45, 36]

## Dizionari

In [6]:
diz = {'giallo': 'chiaro', 
      'verde': 33,
      99: 128,
      100: 'scuro'}
diz

{'giallo': 'chiaro', 'verde': 33, 99: 128, 100: 'scuro'}

Mostrare le chiavi ed i valori degli elementi del dizionario:

In [7]:
diz.keys()
diz.values()

dict_values(['chiaro', 33, 128, 'scuro'])

## Magic
`%magic` e `%lsmagic` sono comandi relativi al pacchetto 'Magic'. Comandi principali:

* `%paste` per copiare dei codici da alcuni siti;
* `%run` per runnare un programma esterno;
* `%timeit` per osservare quanto tempo impiega per runnare una singola riga;
* `%%timeit` per osservare quanto tempo impiega per runnare una intera cella.

In [8]:
%%timeit
diz = {'giallo': 'chiaro', 
      'verde': 33,
      99: 128,
      100: 'scuro'}
diz

157 ns ± 7.68 ns per loop (mean ± std. dev. of 7 runs, 1000000 loops each)

## File
Per aprire un file usare il comando 'with open':

In [9]:
with open("if.txt") as f:
    testo = f.read()
testo

'If you can keep your head when all about you   \n    Are losing theirs and blaming it on you,   \nIf you can trust yourself when all men doubt you,\n    But make allowance for their doubting too;   \nIf you can wait and not be tired by waiting,\n    Or being lied about, don’t deal in lies,\nOr being hated, don’t give way to hating,\n    And yet don’t look too good, nor talk too wise:\n\nIf you can dream—and not make dreams your master;   \n    If you can think—and not make thoughts your aim;   \nIf you can meet with Triumph and Disaster\n    And treat those two impostors just the same;   \nIf you can bear to hear the truth you’ve spoken\n    Twisted by knaves to make a trap for fools,\nOr watch the things you gave your life to, broken,\n    And stoop and build ’em up with worn-out tools:\n\nIf you can make one heap of all your winnings\n    And risk it on one turn of pitch-and-toss,\nAnd lose, and start again at your beginnings\n    And never breathe a word about your loss;\nIf you can force your heart and nerve and sinew\n    To serve your turn long after they are gone,   \nAnd so hold on when there is nothing in you\n    Except the Will which says to them: ‘Hold on!’\n\nIf you can talk with crowds and keep your virtue,   \n    Or walk with Kings—nor lose the common touch,\nIf neither foes nor loving friends can hurt you,\n    If all men count with you, but none too much;\nIf you can fill the unforgiving minute\n    With sixty seconds’ worth of distance run,   \nYours is the Earth and everything that’s in it,   \n    And—which is more—you’ll be a Man, my son!\n'

Si possono splittare le righe:

In [10]:
testo.split("\n")

['If you can keep your head when all about you   ',
 '    Are losing theirs and blaming it on you,   ',
 'If you can trust yourself when all men doubt you,',
 '    But make allowance for their doubting too;   ',
 'If you can wait and not be tired by waiting,',
 '    Or being lied about, don’t deal in lies,',
 'Or being hated, don’t give way to hating,',
 '    And yet don’t look too good, nor talk too wise:',
 '',
 'If you can dream—and not make dreams your master;   ',
 '    If you can think—and not make thoughts your aim;   ',
 'If you can meet with Triumph and Disaster',
 '    And treat those two impostors just the same;   ',
 'If you can bear to hear the truth you’ve spoken',
 '    Twisted by knaves to make a trap for fools,',
 'Or watch the things you gave your life to, broken,',
 '    And stoop and build ’em up with worn-out tools:',
 '',
 'If you can make one heap of all your winnings',
 '    And risk it on one turn of pitch-and-toss,',
 'And lose, and start again at your beginnings',
 '    And never breathe a word about your loss;',
 'If you can force your heart and nerve and sinew',
 '    To serve your turn long after they are gone,   ',
 'And so hold on when there is nothing in you',
 '    Except the Will which says to them: ‘Hold on!’',
 '',
 'If you can talk with crowds and keep your virtue,   ',
 '    Or walk with Kings—nor lose the common touch,',
 'If neither foes nor loving friends can hurt you,',
 '    If all men count with you, but none too much;',
 'If you can fill the unforgiving minute',
 '    With sixty seconds’ worth of distance run,   ',
 'Yours is the Earth and everything that’s in it,   ',
 '    And—which is more—you’ll be a Man, my son!',
 '']

## Funzioni:
Sono essenziali per differenziare i programmi in diverse parti:

In [11]:
def tcost(copie):
    if copie == 0:
        costo = 0
    else:
        costo = round((24.95 * 0.6 + 0.75) * copie + 2.25, 2)
    return(costo)

# <center> Pandas </center>
Il pacchetto Pandas ha la possibilità di utilizzare metodi e funzioni molto utili riguardo alla gestione di dati. Si introducono tre fondamentali oggetti Pandas:

* Series;
* DataFrames;
* Index.

In [12]:
import numpy as np
import pandas as pd

## Series:
Si indica come serie di Pandas un array unidimensionale di valori indicizzati:

In [13]:
data = pd.Series([0.25, 0.5, 0.75, 1.0])
data

0    0.25
1    0.50
2    0.75
3    1.00
dtype: float64

E' possibile stampare sia gli indici sia i valori della serie:

In [14]:
data.values
data.index

RangeIndex(start=0, stop=4, step=1)

Si può anche accedere al valore della serie tramite l'indice della stessa:

In [15]:
data[2]

0.75

Si possono modificare anche gli indici relativi ai valori:

In [16]:
data2 = pd.Series([0.25, 0.5, 0.75, 1.0],
                 index=['a', 'b', 'c', 'd'])
data2
data2['b']

0.5

### Serie come dizionario
Si può considerare una serie di Pandas come uno specifico dizionario

In [17]:
population_dict = {'California': 38332521,
                   'Texas': 26448193,
                   'New York': 19651127,
                   'Florida': 19552860,
                   'Illinois': 12882135}
population = pd.Series(population_dict)
population

California    38332521
Texas         26448193
New York      19651127
Florida       19552860
Illinois      12882135
dtype: int64

In questo modo, la serie verrà creata con indice le chiavi ordinate. Per accedere alla serie, si usa il modo analogo di accesso dei dizionari:

In [18]:
population['California']

38332521

Inoltre, supporta le oprazioni simili alle liste:

In [19]:
population['California':'Illinois']

California    38332521
Texas         26448193
New York      19651127
Florida       19552860
Illinois      12882135
dtype: int64

## DataFrame:
Sai già tutto sui dataframe:

In [20]:
area_dict = {'California': 423967, 'Texas': 695662, 'New York': 141297,
             'Florida': 170312, 'Illinois': 149995}
area = pd.Series(area_dict)
area

states = pd.DataFrame({'population': population,
                       'area': area})
states

            population    area
California    38332521  423967
Texas         26448193  695662
New York      19651127  141297
Florida       19552860  170312
Illinois      12882135  149995

Come le serie, i DataFrame hanno l'attributo indice e l'etichette di colonne:

In [21]:
states.index
states.columns

Index(['population', 'area'], dtype='object')

## File:
Si possono leggere i file csv con Pandas:

In [22]:
df = pd.read_csv("planets.csv")
df

               method  number  orbital_period    mass  distance  year
0     Radial Velocity       1      269.300000   7.100     77.40  2006
1     Radial Velocity       1      874.774000   2.210     56.95  2008
2     Radial Velocity       1      763.000000   2.600     19.84  2011
3     Radial Velocity       1      326.030000  19.400    110.62  2007
4     Radial Velocity       1      516.220000  10.500    119.47  2009
5     Radial Velocity       1      185.840000   4.800     76.39  2008
6     Radial Velocity       1     1773.400000   4.640     18.15  2002
7     Radial Velocity       1      798.500000     NaN     21.41  1996
8     Radial Velocity       1      993.300000  10.300     73.10  2008
9     Radial Velocity       2      452.800000   1.990     74.79  2010
10    Radial Velocity       2      883.000000   0.860     74.79  2010
11    Radial Velocity       1      335.100000   9.880     39.43  2009
12    Radial Velocity       1      479.100000   3.880     97.28  2008
13    Radial Velocity       3     1078.000000   2.530     14.08  1996
14    Radial Velocity       3     2391.000000   0.540     14.08  2001
15    Radial Velocity       3    14002.000000   1.640     14.08  2009
16    Radial Velocity       1        4.230785   0.472     15.36  1995
17    Radial Velocity       5       14.651000   0.800     12.53  1996
18    Radial Velocity       5       44.380000   0.165     12.53  2004
19    Radial Velocity       5     4909.000000   3.530     12.53  2002
20    Radial Velocity       5        0.736540     NaN     12.53  2011
21    Radial Velocity       5      261.200000   0.172     12.53  2007
22    Radial Velocity       3        4.215000   0.016      8.52  2009
23    Radial Velocity       3       38.021000   0.057      8.52  2009
24    Radial Velocity       3      123.010000   0.072      8.52  2009
25    Radial Velocity       1      116.688400     NaN     18.11  1996
26    Radial Velocity       1      691.900000     NaN     81.50  2012
27    Radial Velocity       1      952.700000   5.300     97.18  2008
28    Radial Velocity       1      181.400000   3.200     45.52  2013
29            Imaging       1             NaN     NaN     45.52  2005
...               ...     ...             ...     ...       ...   ...
1005          Transit       1        3.693641     NaN    200.00  2012
1006          Transit       1        4.465633     NaN    330.00  2012
1007          Transit       1        4.617101     NaN    255.00  2012
1008          Transit       1        2.838971     NaN    455.00  2012
1009          Transit       1        5.017180     NaN    300.00  2012
1010          Transit       1        7.919585     NaN    125.00  2012
1011          Transit       1        4.305001     NaN    400.00  2012
1012          Transit       1        3.855900     NaN    480.00  2012
1013          Transit       1        4.411953     NaN    160.00  2012
1014          Transit       1        4.378090     NaN    330.00  2012
1015          Transit       1        1.573292     NaN    350.00  2012
1016          Transit       1        2.311424     NaN    310.00  2013
1017          Transit       1        4.086052     NaN    380.00  2012
1018          Transit       1        4.614420     NaN    225.00  2012
1019          Transit       1        2.903675     NaN    345.00  2012
1020          Transit       1        2.216742     NaN    340.00  2012
1021          Transit       1        2.484193     NaN    260.00  2013
1022          Transit       1        1.360031     NaN     93.00  2012
1023          Transit       1        2.175176     NaN    550.00  2012
1024          Transit       1        3.662387     NaN    240.00  2012
1025          Transit       1        3.067850     NaN     60.00  2012
1026          Transit       1        0.925542     NaN    470.00  2014
1027          Imaging       1             NaN     NaN     19.20  2011
1028          Transit       1        3.352057     NaN   3200.00  2012
1029          Imaging       1             NaN     NaN     10.10  2012
1030          Transit       1        3.941507     NaN    172.00  2006
1031          Transit       1        2.615864     NaN    148.00  2007
1032          Transit       1        3.191524     NaN    174.00  2007
1033          Transit       1        4.125083     NaN    293.00  2008
1034          Transit       1        4.187757     NaN    260.00  2008

[1035 rows x 6 columns]

Si possono utilizzare anche diversi attributi (controlla su Internet). Inoltre, si possono vedere le prime ed ultime righe del dataset:

In [23]:
df.head()
df.tail()

       method  number  orbital_period  mass  distance  year
1030  Transit       1        3.941507   NaN     172.0  2006
1031  Transit       1        2.615864   NaN     148.0  2007
1032  Transit       1        3.191524   NaN     174.0  2007
1033  Transit       1        4.125083   NaN     293.0  2008
1034  Transit       1        4.187757   NaN     260.0  2008

Si possono stampare le statistiche descrittive di ogni variabile del dataset:

In [24]:
df.describe()

            number  orbital_period        mass     distance         year
count  1035.000000      992.000000  513.000000   808.000000  1035.000000
mean      1.785507     2002.917596    2.638161   264.069282  2009.070531
std       1.240976    26014.728304    3.818617   733.116493     3.972567
min       1.000000        0.090706    0.003600     1.350000  1989.000000
25%       1.000000        5.442540    0.229000    32.560000  2007.000000
50%       1.000000       39.979500    1.260000    55.250000  2010.000000
75%       2.000000      526.005000    3.040000   178.500000  2012.000000
max       7.000000   730000.000000   25.000000  8500.000000  2014.000000

## Data Selection:
Si possono selezionari dati secondo specifici condizioni:

In [25]:
area = pd.Series({'California': 423967, 'Texas': 695662,
                  'New York': 141297, 'Florida': 170312,
                  'Illinois': 149995})
pop = pd.Series({'California': 38332521, 'Texas': 26448193,
                 'New York': 19651127, 'Florida': 19552860,
                 'Illinois': 12882135})
data = pd.DataFrame({'area':area, 'pop':pop})
data

              area       pop
California  423967  38332521
Texas       695662  26448193
New York    141297  19651127
Florida     170312  19552860
Illinois    149995  12882135

Inoltre, è possibile aggiungere una colonna con operazioni matematiche;

In [26]:
data['density'] = data['pop'] / data['area']
data
data.loc[data.density > 100, ['pop', 'density']]

               pop     density
New York  19651127  139.076746
Florida   19552860  114.806121

## Aggregation e Grouping:
Si possono utilizzare i comandi di raggruppamento di SQL. Inoltre, si possono usare anche metodi di raggruppamento:

* `count()`: numero degli elementi;
* `first()`, `last()`: primo ed ultimo elemento;
* `mean()`, `median()`: media e mediana;
* `min()`, `max()` : massimo e minimo;
* `std()`, `var()`: deviazione standard e varianza;
* `prod()`: prodotto;
* `sum()`: somma.

In [27]:
df = pd.DataFrame({'key': ['A', 'B', 'C', 'A', 'B', 'C'],
                   'data': range(6)}, columns=['key', 'data'])
df

  key  data
0   A     0
1   B     1
2   C     2
3   A     3
4   B     4
5   C     5

### Aggregation:
Si possono computare tutti i comandi precedenti in una sola volta utilizzando il comando `aggregate()`:

In [28]:
import seaborn as sns
planets = sns.load_dataset('planets')
planets.head()
planets.groupby("method").sum()["year"]

method
Astrometry                          4023
Eclipse Timing Variations          18090
Imaging                            76347
Microlensing                       46225
Orbital Brightness Modulation       6035
Pulsar Timing                       9992
Pulsation Timing Variations         2007
Radial Velocity                  1110158
Transit                           798461
Transit Timing Variations           8050
Name: year, dtype: int64

In [29]:
df.groupby('key').aggregate(['min', np.median, max])

    data
     min median max
key
A      0    1.5   3
B      1    2.5   4
C      2    3.5   5

# <center> Regular Expression </center>

Le espressione regolari sono una sequenza di simboli che identificano un insieme di stringhe.

In [30]:
import re

L'obiettivo è quello di individuare da una stringa un pattern specifico:

In [31]:
occorrenza=re.search(pattern="u", string="George Lucas")

if occorrenza:
  print("Trovato l'occorrenza")
else:
  print("No occorrenza")

Trovato l'occorrenza

## Linguaggio RE
La maggior parte delle lettere e dei caratteri semplicemente corrispondono a sé stessi. Vi sono eccezioni a questa regola, come `. ^ $ * + ? { [ ] \ | ( )`. Per trovare e occorrenze di questi caratteri, si usa `\` (backslash)

Esistono altri caratteri speciali:

* `^` che indica l`inizio della riga;
* `$` che indica la fine della riga;
* `*` che indica 0 o più volte il carattere da trovare;
* `+` che indica 1 o più volte il carattere da trovare;
* `?` che indica 0 o 1 volta il carattere da trovare.

I caratteri `[` e `]` sono utilizzati per raggruppare carattero in una classe.

In [32]:
re.search("[cb]","ciao")

Nell'esempio `[cb]` identifica tutti i caratteri `b` e `c`. Per trovare pattern multipli, si utilizza `|`:

In [33]:
re.search("(ab|gf)", "abbiamo vinto")

Se nella classe è presente `^`, implica che il pattern da cercare è il complemento di quella classe:

In [34]:
re.search("[^a-d]","ciao")

## Classi caratteriali:
Python definisce dei metacaratteri per classi comuni:

* `.`, cerca ogni carattere;
* `\d`, cerca ogni numero (equivalente a `[0-9]`);
* `\D`, cerca il complemento del precedente (equivalente a `^[0-9]`);
* `\s`, cerca ogni spazio (`\t`, `\n`, ecc);
* `\S`, cerca il complemento del precedente;
* `\w`, cerca ogni lettera, (equivalene a `[a-zA-Z0-9_]`);
* `\W`, cerca il complemento del precedente.

## Quantificatori:
Un quantificatore indica quante volte è presente l'espressione speficata, indicata nella forma `{m,n}`, con m e n rispettivamente il numero min e max dell'espressione ripetuta:

In [35]:
re.search('(bla){2,100}', 'blablabla')

## Compile:
Per velocizzare il processo di ricerca di RE si utilizza il comando `compile()`:

In [36]:
lir="""ciao mi ciascn,
    la, la, la, la, la
    Stay forever and ever and ever ah ah
    La, la, la, la, la, la, la, la
    """
la=re.compile('^(La, |la, )+la$')
for line in lir:
  occ = la.search(line)
  if not occ:
    pass

## Grouping:
Molto spesso è opportuno ottenere più informaione dalla ricerca di una RE; si possono accedere ai gruppi utilizzando il metodo `group()`

Per estrarre i gruppi si devono per forza utilizzare le parentesi

In [37]:
name_surname_re = re.compile("^(\d+)\s+(\w+)\s+(\w+)$", re.IGNORECASE)

m = name_surname_re.search("3          Giorgio   Chiellini")
print("Whole match:  ", m.group())
print("Name:         ", m.group(2))
print("Surname:      ", m.group(3))

m = name_surname_re.search("14 Blaise                        Matuidi")
print("Whole match:  ", m.group())
print("Shirt number: ", m.group(1))
print("Surname:      ", m.group(3))

Whole match:   3          Giorgio   Chiellini
Name:          Giorgio
Surname:       Chiellini
Whole match:   14 Blaise                        Matuidi
Shirt number:  14
Surname:       Matuidi

Se i gruppi da estrarre sono tanti, i possono nominare con il comando `?P<nome>*espr*`

In [38]:
ns_named_re = re.compile("^(?P<shirtnumber>\d+)\s+(?P<name>\w+)\s+(?P<surname>\w+)$")

m = ns_named_re.search("3 Giorgio            Chiellini")
print("Whole match:  ", m.group())
print("Name:         ", m.group("name"))
print("Surname:      ", m.group("surname"))

Whole match:   3 Giorgio            Chiellini
Name:          Giorgio
Surname:       Chiellini

## Backreference:
Permette di specificare che i contenuti di un gruppo pssono essere trovati anche nella stringa. Sono molto utili in molte situazioni:

* Identificare parole doppie:

In [39]:
doubled_words = re.findall(r'\b(\w+)\s+\1\b',
                          'writing doubled doubled words is is a common mistake while writing papers and reports reports')
print(doubled_words)

['doubled', 'is', 'reports']

* Rimuovere parole doppie:

In [40]:
doubled_words_removed = re.sub(r'\b(\w+)\s+\1\b', r'\1',
                              'writing doubled doubled words is is a common mistake while writing papers and reports reports')

print(doubled_words_removed)

writing doubled words is a common mistake while writing papers and reports

Oss: Re lavora solamente su un ?
#  <center> Operazioni con gli NA: </center>
Il pacchetto `Pandas` tratta i `None` e `NaN` intercambiabili per identificare un valore mancante. Esistono diversi comandi per lavorare con gli NA:

* `isnull()`: genera un booleano per indicare se è presente NA o meno;
* `notnull()`: l'opposto di isnull();
* `dropna()`: cancella le righe con gli NA;
* `fillna()`: riporta una copia dei dati NA imputati.

In [41]:
import numpy as np
import pandas as pd

## isnull() e notnull():
Entrambi i comandi stampano un valore booleano in base alla presenza o meno di NA.

In [42]:
data = pd.Series([1, np.nan, 'hello', None])
print(data.isnull())
print(data.notnull())

0    False
1     True
2    False
3     True
dtype: bool
0     True
1    False
2     True
3    False
dtype: bool

## dropna():
Per le serie, esso estrae solamente le osservazioni non NA:

In [43]:
print(data.dropna())

0        1
2    hello
dtype: object

Per i dataframe, esistono diferse funzioni. NON è possibile estrarre singoli valori dai datarame, ma l'intera colonna o riga; perciò, di fronte ad un valore mancante, `dropna()` elimina l'intera riga, mantenendo gli indici di colonna e di riga:

In [44]:
df = pd.DataFrame([[1,      np.nan, 2],
                   [2,      3,      5],
                   [np.nan, 4,      6]])
df.dropna(axis="columns")
df.dropna(axis="rows")

     0    1  2
1  2.0  3.0  5

Se si è interessati ad eliminare una intera riga o colonna di NA, si può utilizzare il parametro `how` all'interno del comando:

In [45]:
df[3]=np.nan;df
df.dropna(axis='columns', how='all')

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

# <center> Hierarchical Indexing: </center>
Molte volte capita che la chiave primaria di un DB abbia più di un indice. Pandas può compiere queste operazioni più efficientemente di un normale ciclo for. Si consideri il seguente esempio:

In [46]:
index = [('California', 2000), ('California', 2010),
         ('New York', 2000), ('New York', 2010),
         ('Texas', 2000), ('Texas', 2010)]
populations = [33871648, 37253956,
               18976457, 19378102,
               20851820, 25145561]
pop = pd.Series(populations, index=index)
pop

(California, 2000)    33871648
(California, 2010)    37253956
(New York, 2000)      18976457
(New York, 2010)      19378102
(Texas, 2000)         20851820
(Texas, 2010)         25145561
dtype: int64

Si possono selezionare le righe con doppio indice:

In [47]:
pop[('California', 2010):('Texas', 2000)]

(California, 2010)    37253956
(New York, 2000)      18976457
(New York, 2010)      19378102
(Texas, 2000)         20851820
dtype: int64

Per selzionare solamente le righe degli anni 2000, piuttosto che fare un ciclo for, si possono utilizzare i comandi di Pandas:

In [48]:
pop[[i for i in pop.index if i[1] == 2010]]

(California, 2010)    37253956
(New York, 2010)      19378102
(Texas, 2010)         25145561
dtype: int64

In [49]:
index = pd.MultiIndex.from_tuples(index)
pop = pop.reindex(index)
df=pop.reset_index()

df.columns=['stato','anno','popolazione']
df[df['anno']==2000]
pop[:,2010]

California    37253956
New York      19378102
Texas         25145561
dtype: int64

# <center> Merge e Join: </center>
Per unire due dataset, si utilizza il comando `merge`, specificando __sempre__ la chiave di unione:

In [50]:
df1 = pd.DataFrame({'employee': ['Bob', 'Jake', 'Lisa', 'Sue'],
                    'group': ['Accounting', 'Engineering', 'Engineering', 'HR']})
df2 = pd.DataFrame({'employee': ['Lisa', 'Bob', 'Jake', 'Sue'],
                    'hire_date': [2004, 2008, 2012, 2014]})
print(df1, df2)

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR   employee  hire_date
0     Lisa       2004
1      Bob       2008
2     Jake       2012
3      Sue       2014

In [51]:
df3 = pd.merge(df1, df2, on="employee");df3

  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004
3      Sue           HR       2014

## Left-join e Right-join:
Molte volte capita di dover unire due dataset tramite una chiave con differenti nomi. In questo caso, si vuole unire due dataset con etichette di colonne `name` ed `employee`. Si possono utilizzare i comandi `left_on` e `right_on`per specificare le due colonne:

In [52]:
df3 = pd.DataFrame({'name': ['Bob', 'Jake', 'Lisa', 'Sue'],
                    'salary': [70000, 80000, 120000, 90000]})
pd.merge(df1, df3, left_on="employee", right_on="name").drop('name', axis=1)

  employee        group  salary
0      Bob   Accounting   70000
1     Jake  Engineering   80000
2     Lisa  Engineering  120000
3      Sue           HR   90000